[
    {
        "doc_id": "CSI-1",
        "title": "CSI 1306 Computing Concepts for Business ",
        "description": "Introduction to computer-based problem solving from the perspective of the business world. Design of algorithms for solving business problems. Basics of computer programming in a modern programming language. Solving business problems using application packages including spreadsheets and databases. Basics of web design. Collaborative tools. Using open source software.",
        "snippet": "Introduction to computer-based problem solving from the perspective of the business world.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-2",
        "title": "CSI 1308 Introduction to Computing Concepts ",
        "description": "Introduction to computer based problem solving for scientific applications.  Design of algorithms and algorithms descriptions.  4th generation languages. Software packages.  Structured program development.  Modular and object-oriented programming.  Program testing.",
        "snippet": "Introduction to computer based problem solving for scientific applications.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-3",
        "title": "CSI 1390 Introduction to Computers ",
        "description": "Computing and computers. Problem solving and algorithm development. Introduction to programming. Use of application, communication, and database software.",
        "snippet": "Computing and computers.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-4",
        "title": "CSI 1706 Éléments de programmation pour la gestion ",
        "description": "Introduction aux méthodes de résolution informatisées dans le cadre du monde des affaires. Conception d'algorithmes pour résoudre des problèmes d'affaires. Éléments de base de programmation dans un langage de programmation moderne. Résolution de problèmes d'affaires à l'aide d'applications telles que les tableurs et les bases de données. Éléments de base de la conception pour le web. Outils de collaboration. Utilisation de logiciel libre.",
        "snippet": "Introduction aux méthodes de résolution informatisées dans le cadre du monde des affaires.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-5",
        "title": "CSI 1708 Introduction aux concepts de l'informatique ",
        "description": "Introduction aux méthodes de résolution de problèmes par ordinateur dans le cadre des applications scientifiques.  Conception et description des algorithmes.  Langages de 4e génération.  Logiciels. Développement de programmes modulaires, structurés et orientés objet. Tests de programmes.",
        "snippet": "Introduction aux méthodes de résolution de problèmes par ordinateur dans le cadre des applications scientifiques.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-6",
        "title": "CSI 1790 Introduction aux ordinateurs ",
        "description": "Le traitement de l'information et les ordinateurs. La résolution de problèmes. Développement des algorithmes. Introduction aux concepts de la programmation. Utilisation de logiciels d'application, de communication et de bases de données.",
        "snippet": "Le traitement de l'information et les ordinateurs.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-7",
        "title": "CSI 2101 Discrete Structures ",
        "description": "Discrete structures as they apply to computer science, algorithm analysis and design. Predicate logic. Review of proof techniques; application of induction to computing problems. Graph theory applications in information technology. Program correctness, preconditions, postconditions and invariants. Analysis of recursive programs using recurrence relations. Properties of integers and basic cryptographical applications.",
        "snippet": "Discrete structures as they apply to computer science, algorithm analysis and design.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-8",
        "title": "CSI 2110 Data Structures and Algorithms ",
        "description": "The concept of abstract data types. Simple methods of complexity analysis. Trees. The search problem: balanced trees, binary-trees, hashing. Sorting. Graphs and simple graph algorithms: traversal, minimum spanning tree. Strings and pattern matching.",
        "snippet": "The concept of abstract data types.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-9",
        "title": "CSI 2120 Programming Paradigms ",
        "description": "Presentation of the major programming paradigms: object-oriented, imperative, logic, functional. Related programming languages, their essential properties and typical applications. Programming in imperative, logic and functional languages. Influence of programming paradigms on problem solving and program design strategies. An overview of other paradigms, such as constraint-based, rule-based and event-driven programming.",
        "snippet": "Presentation of the major programming paradigms: object-oriented, imperative, logic, functional.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-10",
        "title": "CSI 2132 Databases I ",
        "description": "Fundamental database concepts. Entity-Relationship modeling. Relational algebra and relational calculus. Relational databases. Database definition and manipulation using SQL. Embedded SQL. Functional dependencies and normalization. Introduction to physical database design. Design and implementation of a database application in a team project.",
        "snippet": "Fundamental database concepts.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-11",
        "title": "CSI 2372 Advanced Programming Concepts With C++ ",
        "description": "Differences between C++ and Java programming.  C++ data types. Pointers and memory management.  Object oriented programming in C++. File and stream I/O.  Pre-processor macros. Templates and the Standard Template Library.  Numerical computation in C++.  Interfacing with hardware.  Engineering applications.",
        "snippet": "Differences between C++ and Java programming.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-12",
        "title": "CSI 2501 Structures discrètes ",
        "description": "Structures discrètes utilisées en informatique. Analyse et conception des algorithmes.  Logique des prédicats. Révision des techniques de preuves. Application de l'induction aux problèmes en informatique. Théorie des graphes. Applications en technologie de l'information. Justesse des programmes correction.  Pré, post conditions et invariants.  Analyse des programmes récursifs à l'aide des relations de récurrence. Propriétés des entiers et application de base et en cryptographie.",
        "snippet": "Structures discrètes utilisées en informatique.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-13",
        "title": "CSI 2510 Structures de données et algorithmes ",
        "description": "Types abstraits de données. Méthodes simples d'analyse de complexité. Arbres. Recherche : arbres binaires, arbres équilibrés et hachage. Tris.  Graphes et algorithmes simples pour graphes : parcours, arbre minimal recouvrant. Chaînes, patrons et filtrage.",
        "snippet": "Types abstraits de données.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-14",
        "title": "CSI 2520 Paradigmes de programmation ",
        "description": "Présentation des principaux paradigmes de programmation: orienté objet, impératif, logique, fonctionnel.  Langages de programmation correspondants, leurs propriétés essentielles et leurs applications typiques. Programmation avec langages impératifs, logiques et fonctionnels.  Influence des paradigmes de programmation sur la résolution de problèmes et les stratégies de conception de programmes. Survol d'autres paradigmes tels que les programmations orientées contraintes, à base de règles, et événementielle.",
        "snippet": "Présentation des principaux paradigmes de programmation: orienté objet, impératif, logique, fonctionnel.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-15",
        "title": "CSI 2532 Bases de données I ",
        "description": "Concepts fondamentaux des bases de données. Modèle entité relation. Algèbre et calcul relationnels. Bases de données relationnelles. Définition de bases de données et manipulation à l'aide de SQL embarqué. Dépendances fonctionnelles et normalisation. Introduction à la conception physique des bases de données. Conception et implantation d'une application avec base de données (projet d'équipe)",
        "snippet": "Concepts fondamentaux des bases de données.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-16",
        "title": "CSI 2772 Concepts avancés de programmation en C++ ",
        "description": "Différences entre la programmation Java et la programmation C++. Pointeurs et gestion de la mémoire.  Programmation orientée objet en C++.  Entrée-sortie des fichiers et flux de données.  Macros du préprocesseur.  Classes génériques et bibliothèque STL. Calcul numérique en C++.  Interfaçage avec le matériel.  Applications d'ingénierie.",
        "snippet": "Différences entre la programmation Java et la programmation C++.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-17",
        "title": "CSI 2911 Pratique professionnelle de l'informatique / Professional Practice in Computing ",
        "description": "Professionnalisme en informatique. Pratique éthique. Propriété intellectuelle. Répercussions sociales de l'informatique. Confidentialité et aspects légaux. / Professionalism in Computer Science. Ethical practice. Intellectual property rights. Social impact of computing. Privacy and legal issues.",
        "snippet": "Professionnalisme en informatique.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-18",
        "title": "CSI 3104 Introduction to Formal Languages ",
        "description": "Regular languages, finite automata, transition graphs Kleene's theorem. Finite automata with output. Context-free languages, derivation trees, normal form grammars, pumping lemma, pushdown automata, determinism. Decidability. Recursively enumerable languages, Turing machines, the halting problem.",
        "snippet": "Regular languages, finite automata, transition graphs Kleene's theorem.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-19",
        "title": "CSI 3105 Design and Analysis of Algorithms I ",
        "description": "Analysis of algorithms: worst-case analysis, complexity analysis, asymptotic notations and basic complexity classes. Algorithm design techniques: brute force, divide and conquer, dynamic programming, greedy, backtracking. Computational complexity of problems: lower bound arguments, the classes P, NP, NP-complete, dealing with NP-complete problems.",
        "snippet": "Analysis of algorithms: worst-case analysis, complexity analysis, asymptotic notations and basic complexity classes.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-20",
        "title": "CSI 3120 Programming Language Concepts ",
        "description": "Design and evaluation criteria for programming languages. Introduction to syntactic and semantic description of programming languages. Basics of programming language implementation. Scripting languages. A comparison of design choices across programming paradigms: data objects, data types, control structures, sub-programs. Basics of concurrency.",
        "snippet": "Design and evaluation criteria for programming languages.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-21",
        "title": "CSI 3130 Databases II ",
        "description": "Advanced physical database design. Access right, privacy and security. Query processing and optimization. Transaction processing, concurrency control and recovery. Object-oriented databases. Distributed and multi-databases. Data warehousing.  Data integration. Design and implementation of a database component in a team project.",
        "snippet": "Advanced physical database design.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-22",
        "title": "CSI 3131 Operating Systems ",
        "description": "Principles of operating systems. Operating systems design issues. Process management, process scheduling, concurrency issues. CPU scheduling. Memory management. Virtual memory. Mass storage systems. Input/Output system. File system. Security and protection. Examples of operating systems.",
        "snippet": "Principles of operating systems.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-23",
        "title": "CSI 3140 WWW Structures, Techniques and Standards ",
        "description": "Basic infrastructure of the Web. Servers and browsers. Examples of protocols. Internet and viruses. Search engine architecture. WWW Contents and presentation. Web pages, their structuring and interpretation. HTML, XML and their derivatives. Web interfaces to software and databases. Cookies and privacy issues. Semantic Web and o ontologies. Web services.",
        "snippet": "Basic infrastructure of the Web.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-24",
        "title": "CSI 3504 Introduction aux langages formels ",
        "description": "Langages réguliers, automates d'états finis, graphes de transition et théorème de Kleene. Automates d'états finis avec sortie. Langages non-contextuels, arbres de dérivation, grammaires de forme normale, automates à pile, déterminisme. Décidabilité. Langages recursivement dénombrables, machines de Turing, le problème de terminaison.",
        "snippet": "Langages réguliers, automates d'états finis, graphes de transition et théorème de Kleene.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-25",
        "title": "CSI 3505 Conception et analyse des algorithmes I ",
        "description": "Analyse des cas moyens et du pire cas. Analyse de la complexité. Notations asymptotiques et classes de complexité de base. Techniques de conception d'algorithmes: exhaustive, diviser pour régner, programmation dynamique glouton, retour arrière. Complexité computationnelle de problèmes : arguments de borne inférieure. Classes P, NP, et NP complet; traitement  des problèmes NP complet.",
        "snippet": "Analyse des cas moyens et du pire cas.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-26",
        "title": "CSI 3520 Concepts des langages de programmation ",
        "description": "Critères de conception et d'évaluation pour langages de programmation. Introduction à leur description syntaxique et sémantique.  Principes d'implantation. Langages de script.  Comparaison de choix de conception selon le paradigme de programmation: objets, types, structures de contrôle, sous-programmes. Éléments de concurrence.",
        "snippet": "Critères de conception et d'évaluation pour langages de programmation.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-27",
        "title": "CSI 3530 Bases de données II ",
        "description": "Conception avancée de bases de données physiques. Droits d'accès, protection et sécurité.  Traitement et optimisation des requêtes. Traitement des transactions, contrôle du parallélisme et reprise. Bases de données orientées objets, base de données distribuées et multi-bases de données. Entrepôts de données. Intégration des données. Conception et implantation d'un composant de base de données (projet de groupe).",
        "snippet": "Conception avancée de bases de données physiques.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-28",
        "title": "CSI 3531 Systèmes d'exploitation ",
        "description": "Principes et conception des systèmes d'exploitation.  Gestion des processus, ordonnancement des processus et concurrence. Ordonnancement du processeur. Gestion de la mémoire. Mémoire virtuelle. Mémoire de masse. Entrées/sorties.  Système de fichiers. Sécurité et protection.  Exemples de systèmes d'exploitation.",
        "snippet": "Principes et conception des systèmes d'exploitation.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-29",
        "title": "CSI 3540 Structures, techniques et normes du Web ",
        "description": "Infrastructure de base du Web. Serveurs et navigateurs. Exemples de protocoles.  Internet et virus. Architecture de moteur de recherche. Contenu et présentation Web. Pages Web, leur structure et leur interprétation. HTML, XML et leurs dérivés. Interfaces Web vers les logiciels et bases de données. Témoins et droit  à la vie privé. Web sémantique et ontologies. Services Web.",
        "snippet": "Infrastructure de base du Web.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-30",
        "title": "CSI 4101 Theory of Computability ",
        "description": "Recursive functions, recursively enumerable sets, decision problems, Church-Turing thesis. S-M-N theorem, recursion theorem. Topics selected from: Lambda calculus, formal languages, logic complexity theory.",
        "snippet": "Recursive functions, recursively enumerable sets, decision problems, Church-Turing thesis.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-31",
        "title": "CSI 4103 Topics in Computer Science I ",
        "description": "Selected topics in areas not covered by regular courses.",
        "snippet": "Selected topics in areas not covered by regular courses.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-32",
        "title": "CSI 4104 Topics in Computer Science II ",
        "description": "Selected topics in areas not covered by regular courses.",
        "snippet": "Selected topics in areas not covered by regular courses.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-33",
        "title": "CSI 4105 Design and Analysis of Algorithms II ",
        "description": "Theory of NP-completeness, methods for dealing with NP-complete problems. Selected topics in such areas as combinatorial optimization, computational geometry, cryptography, parallel algorithms.",
        "snippet": "Theory of NP-completeness, methods for dealing with NP-complete problems.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-34",
        "title": "CSI 4106 Introduction to Artificial Intelligence ",
        "description": "The roots and scope of Artificial Intelligence.  Knowledge and knowledge representation. Search, informed search, adversarial search. Deduction and reasoning. Uncertainty in Artificial Intelligence. Introduction to Natural Language Processing. Elements of planning. Basics of Machine Learning.",
        "snippet": "The roots and scope of Artificial Intelligence.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-35",
        "title": "CSI 4107 Information Retrieval and the Internet ",
        "description": "Basic principles of Information Retrieval.  Indexing methods.  Query processing.  Linguistic aspects of Information Retrieval.  Agents and artificial intelligence approaches to Information Retrieval.  Relation of Information Retrieval to the World Wide Web.  Search engines. Servers and clients.  Browser and server side programming for Information Retrieval.",
        "snippet": "Basic principles of Information Retrieval.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-36",
        "title": "CSI 4108 Cryptography ",
        "description": "The notion of secure communication.  Building secure cryptosystems based on the assumption of computational hardness. Cryptographic one-way functions, trap-door functions, pseudorandom generators, and public/private-key encryption schemes. Computational indistinguishable and unpredictability.  Digital signature and message authentication. Zero-knowledge/interactive proof systems. Application to e-commerce and e-trade.",
        "snippet": "The notion of secure communication.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-37",
        "title": "CSI 4109 Introduction to Distributed Computing ",
        "description": "Computational models. Communication complexity.  Design and analysis of distributed algorithms.  Control algorithms.  Asynchronous computations. Synchronous computations.  Fault-tolerant algorithms.  Manipulation of distributed data.  Examples of applications in data and communication networks, mobile computing and systems of communicating agents.",
        "snippet": "Computational models.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-38",
        "title": "CSI 4115 Introduction to Compilers ",
        "description": "Fundamental features of programming languages, functions of compilers, processors, preprocessors, and translators. Organization of compilers including compile-time and run-time symbol tables. Lexical and syntactic analysis. Object code generation. Error diagnostics.",
        "snippet": "Fundamental features of programming languages, functions of compilers, processors, preprocessors, and translators.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-39",
        "title": "CSI 4118 Computer Networks Protocols ",
        "description": "Communication services, protocols and software. Details of layered protocol hierarchies.  The transport, session, presentation and application layers.  Fundamental concepts of computer network design. Computer network and communication protocol architectures.",
        "snippet": "Communication services, protocols and software.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-40",
        "title": "CSI 4124 Foundation of Modelling and Simulation ",
        "description": "The modelling and simulation process from a project oriented perspective. The role of conceptual modelling in the discrete event dynamic system context. Dealing with randomness. Distinctive features of modelling and simulation for continuous time dynamic systems and overview of numerical procedures. Validation and verification. Simulation software and program development.",
        "snippet": "The modelling and simulation process from a project oriented perspective.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-41",
        "title": "CSI 4125 Theory of Programming Languages ",
        "description": "The concept of formal semantics. Attribute grammars. Denotational semantics. Operational semantics. Axiomatic semantics. Lambda-calculus for programming language description. Resolution and the semantics of logic programming. Theory of abstract data types. Concurrent programming, process algebras, CCS, CSP.",
        "snippet": "The concept of formal semantics.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-42",
        "title": "CSI 4126 Algorithms in Bioinformatics ",
        "description": "DNA assembly, gene finding methods, exact string matching, pairwise alignment, grammatical frameworks, higher order structures. Recent developments, including DNA and protein chips.",
        "snippet": "DNA assembly, gene finding methods, exact string matching, pairwise alignment, grammatical frameworks, higher order structures.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-43",
        "title": "CSI 4130 Computer Graphics ",
        "description": "Interactive computer graphics. Display data structures and procedures. Graphics pipeline. Geometric transformations. Viewing in three dimensions. Illumination and color models. Object modelling in 2D and 3D.",
        "snippet": "Interactive computer graphics.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-44",
        "title": "CSI 4133 Computer Methods in Picture Processing and Analysis ",
        "description": "Representation of digital pictures. Elements of visual perception. Imaging geometry. Image enhancement and image restoration. Image segmentation and feature identification. Content-based analysis of images. Images compression, compression standards and graphics file format.",
        "snippet": "Representation of digital pictures.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-45",
        "title": "CSI 4134 Pattern Recognition Technics ",
        "description": "Review of mathematical aspects of pattern classification in the context of picture processing languages. Practical examples in pattern recognition.",
        "snippet": "Review of mathematical aspects of pattern classification in the context of picture processing languages.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-46",
        "title": "CSI 4139 Design of Secure Computer Systems ",
        "description": "Security policies. Security mechanisms. Physical security. Security awareness. User authentication. Application security mechanisms. Encryption. External and internal firewalls. Security of operating systems and software. Security of e-commerce applications. Design of security system and components. Devices for security analysis; sniffers, attack detectors. Information warfare. Ethical issues in computer security.",
        "snippet": "Security policies.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-47",
        "title": "CSI 4140 Introduction to Parallel Computing ",
        "description": "Models of parallel computation. Architecture of parallel computers. Interconnection networks. Communication primitives. MPI, OpenMP. Principles of parallel algorithm design. Partitioning strategies. Load balancing. Analytical modeling of parallel programs. Parallel linear algebra. Parallel sorting. Parallel graph algorithms. Parallel searching.",
        "snippet": "Models of parallel computation.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-48",
        "title": "CSI 4141 Real Time Systems Design ",
        "description": "Definition of real-time systems;  examples.  Characteristics of real-time systems.  Analysis frameworks and tools.  Elements of real-time system structure.  Reliability and fault tolerance. Exceptions and exception handling.  Concurrency and concurrent programming in real-time systems.  Synchronisation and communication, resource control, and scheduling in real-time systems. Real-time system design methodologies.  Computer assisted design of real-time systems.",
        "snippet": "Definition of real-time systems;  examples.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-49",
        "title": "CSI 4142 Fundamentals of Data Science ",
        "description": "Big data, analytics, and cloud computing; data preparation: organization, basic statistics, cleaning, and integration; data mining techniques: pattern mining, classification, clustering, outlier and anomaly detection; model evaluation; data warehousing and multi-dimensional analysis; data visualization and visual data analytics.",
        "snippet": "Big data, analytics, and cloud computing; data preparation: organization, basic statistics, cleaning, and integration; data mining techniques: pattern mining, classification, clustering, outlier and anomaly detection; model evaluation; data warehousing and multi-dimensional analysis; data visualization and visual data analytics.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-50",
        "title": "CSI 4145 Machine Learning ",
        "description": "Basic concepts of machine learning. Essentials of mathematics. Supervised learning. Unsupervised learning. Reinforcement learning. Algorithms for regression, classification, density estimation, and clustering.",
        "snippet": "Basic concepts of machine learning.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-51",
        "title": "CSI 4150 Introduction to Optimization Methods ",
        "description": "Linear optimization models and their solution.  Modelling techniques for linear programming problems, the simplex solution method, duality theory, sensitivity analysis, interior point methods.  Formulation of problems as integer linear programs, solution methods such as branch and bound and cutting plane algorithms.",
        "snippet": "Linear optimization models and their solution.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-52",
        "title": "CSI 4501 Théorie de la calculabilité ",
        "description": "Fonctions récursives, ensembles récursivement dénombrables. Décidabilité. Thèse de Church-Turing. Théorèmes S-M-N et de la récursion. Thèmes choisis parmi le calcul-Lambda, les langages formels, la logique et la théorie de la complexité.",
        "snippet": "Fonctions récursives, ensembles récursivement dénombrables.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-53",
        "title": "CSI 4503 Sujets en informatique I ",
        "description": "Sujets choisis dans des domaines non couverts par les cours réguliers.",
        "snippet": "Sujets choisis dans des domaines non couverts par les cours réguliers.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-54",
        "title": "CSI 4504 Sujets en informatique II ",
        "description": "Sujets choisis dans des domaines non couverts par les cours réguliers.",
        "snippet": "Sujets choisis dans des domaines non couverts par les cours réguliers.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-55",
        "title": "CSI 4505 Conception et analyse des algorithmes II ",
        "description": "Théorie du NP-complet. Méthodes de traitement des problèmes NP-complets. Sujets choisis parmi les domaines suivants: optimisation combinatoire, géométrie de calcul, cryptographie, algorithmes parallèles.",
        "snippet": "Théorie du NP-complet.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-56",
        "title": "CSI 4506 Introduction à l'intelligence artificielle ",
        "description": "Concepts et méthodes de base de l'intelligence artificielle. Connaissances et représentation des connaissances. Recherche, recherche stratégique, jeux de stratégie. Raisonnement et déduction. Incertitude en intelligence artificielle. Introduction au traitement du langage naturel. Éléments de base de la planification. Éléments de base de l'apprentissage automatique.",
        "snippet": "Concepts et méthodes de base de l'intelligence artificielle.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-57",
        "title": "CSI 4507 Recherche d'information et l'Internet ",
        "description": "Principes de base de la recherche d'information.  Méthodes d'indexage. Traitement des requêtes.  Aspects linguistiques de la recherche d'information.  Agents et approches d'intelligence artificielle pour la recherche d'information.  Relation entre la recherche d'information et le World Wide Web.  Moteur de recherche.  Serveurs et clients. Programmation du côté client et du côté serveur pour la recherche d'information.",
        "snippet": "Principes de base de la recherche d'information.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-58",
        "title": "CSI 4508 Cryptographie ",
        "description": "La notion de communication sûre.  Construction de cryptosystèmes sûrs fondée sur l'hypothèse de la complexité calculatoire.  Fonctions cryptographiques unidirectionnelles, fonctions à portes de déroutement, générateurs pseudo-aléatoires, et schémas de chiffrement à clé publique/privée.  Incapacité de distinction et imprévisibilité calculatoires.  Signature numérique et authentification de messages. Systèmes de preuves interactifs/à divulgation nulle.  Application au commerce électronique et au courtage électronique.",
        "snippet": "La notion de communication sûre.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-59",
        "title": "CSI 4509 Introduction au calcul réparti ",
        "description": "Modèles de calcul.  Complexité de communication.  Conception et analyse d'algorithmes répartis.  Algorithmes de contrôle.  Calcul dans les systèmes asynchrones.  Calcul dans les systèmes synchrones. Algorithmes tolérants aux défaillances. Manipulation de données réparties.  Exemples d'applications dans les réseaux de communication, réseaux mobiles, et systèmes d'agents communicants.",
        "snippet": "Modèles de calcul.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-60",
        "title": "CSI 4515 Introduction aux compilateurs ",
        "description": "Les caractéristiques essentielles des langages de programmation. Les fonctions des compilateurs, processeurs, préprocesseurs, et traducteurs. Organisation d'un compilateur et génération de tables. Analyse lexicale et syntaxique. Génération du code en langage objet. Détection d'erreurs.",
        "snippet": "Les caractéristiques essentielles des langages de programmation.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-61",
        "title": "CSI 4518 Réseaux d'ordinateurs et protocoles ",
        "description": "Services de communication, protocoles et logiciels. Détails des hiérarchies de protocoles à couches. Les couches transport, session, présentation et application. Concepts fondamentaux de la conception de réseaux d'ordinateurs. Architectures de réseaux d'ordinateurs et de protocoles de communication.",
        "snippet": "Services de communication, protocoles et logiciels.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-62",
        "title": "CSI 4524 Principes de base de modélisation et simulation ",
        "description": "Le processus de la modélisation et la simulation de la perspective d un projet. Le rôle de la modélisation conceptuelle dans le contexte de système dynamique d évènements discrets. Composer avec des phénomènes aléatoires. Les caractéristiques particulières de la modélisation et simulation pour les systèmes dynamiques à temps continu et un survol des procédures numériques.  Validation et vérification.  Logiciel de simulation et le développement de programmation.",
        "snippet": "Le processus de la modélisation et la simulation de la perspective d un projet.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-63",
        "title": "CSI 4525 Théorie des langages de programmation ",
        "description": "Le concept de sémantique formelle.  Grammaires d'attributs.  Sémantique dénotationnelle.  Sémantique opérationnelle.  Sémantique axiomatique. Le calcul Lambda pour la description des langages de programmation. Le principe de résolution et la sémantique des langages de programmation logique.  Théories de types abstraits de données. Programmation parallèle, algèbres de processus, CCS, CSP.",
        "snippet": "Le concept de sémantique formelle.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-64",
        "title": "CSI 4526 Algorithmes en bio-informatique ",
        "description": "Assemblage de l'ADN, recherche de gènes, comparaison de chaînes, alignement de séquences, structures grammaticales, structures secondaires et tertiaires.  Les récents développements, tels que les puces d'ADN et de protéines.",
        "snippet": "Assemblage de l'ADN, recherche de gènes, comparaison de chaînes, alignement de séquences, structures grammaticales, structures secondaires et tertiaires.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-65",
        "title": "CSI 4530 Graphiques interactifs ",
        "description": "Infographie interactive. Structures de données et procédures d'affichage. Pipeline graphique. Transformations géométriques. Représentation en trois dimensions. Modèles de couleur et d'illumination. Modélisation d'objets en deux et trois dimensions.",
        "snippet": "Infographie interactive.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-66",
        "title": "CSI 4533 Méthodes informatisées en traitement d'image ",
        "description": "",
        "snippet": "",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-67",
        "title": "CSI 4534 Techniques de reconnaissance des formes ",
        "description": "Étude des aspects mathématiques associés à la classification de modèles dans le contexte des langages de traitement d'image. Exemples pratiques en concordance de modèles.",
        "snippet": "Étude des aspects mathématiques associés à la classification de modèles dans le contexte des langages de traitement d'image.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-68",
        "title": "CSI 4539 Conception de systèmes informatiques sécuritaires ",
        "description": "Politiques de sécurité. Mécanismes de sécurité. Sécurité physique. Conscience de la sécurité. Authentification d'utilisateur. Application des mécanismes de sécurité. Codage. \"Firewalls\" internes et externes. Sécurité des systèmes d'opération et des logiciels. Sécurité des applications de commerce électronique. Design de systèmes et composantes de sécurité. Dispositifs pour l'analyse de la sécurité, renifleurs, détecteurs d'attaque. Guerre de l'information. Aspects éthiques de la sécurité informatique.",
        "snippet": "Politiques de sécurité.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-69",
        "title": "CSI 4540 Introduction au calcul parallèle ",
        "description": "Modèles de calcul parallèle. Machines parallèles à mémoire partagée. Réseaux d'interconnexion et leurs propriétés topologiques. Tableaux systoliques. Architectures hypercube. Configuration physique. Mesures de performance pour algorithmes parallèles. Recherche parallèle et structures de données. Traitement algébrique et géométrique parallèle. Calcul tolérant les pannes. Évaluation parallèle d'expressions.",
        "snippet": "Modèles de calcul parallèle.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-70",
        "title": "CSI 4541 Conception de systèmes en temps réel ",
        "description": "Définition de systèmes en temps réel;  exemples.  Caractéristiques de systèmes en temps réel.  Outils et techniques d'analyse.  Structure de systèmes en temps réel.  Fiabilité et tolérance de défaillances. Prise en charge d'exceptions.  Simultanéité d'exécution et programmation simultanée de systèmes en temps réel.  Synchronisation et communication, contrôle et ordonnancement de ressources dans des systèmes en temps réel.  Méthodologies de conception de systèmes en temps réel.  Conception assistée par ordinateur de systèmes en temps réel.",
        "snippet": "Définition de systèmes en temps réel;  exemples.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-71",
        "title": "CSI 4542 Principes fondamentaux de la science des données ",
        "description": "Données massives, analyse de données et infonuagique; préparation des données : organisation, statistiques de base, nettoyage et intégration des données; techniques d'exploration de données, exploration des motifs, classification, partionnement des données, détection des données aberrantes, évaluation des modèles, entreposage des données et analyse multidimensionnelle, visualisation des données, analyse des données visuelles.",
        "snippet": "Données massives, analyse de données et infonuagique; préparation des données : organisation, statistiques de base, nettoyage et intégration des données; techniques d'exploration de données, exploration des motifs, classification, partionnement des données, détection des données aberrantes, évaluation des modèles, entreposage des données et analyse multidimensionnelle, visualisation des données, analyse des données visuelles.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-72",
        "title": "CSI 4545 Apprentissage automatique ",
        "description": "Concepts de base de l'apprentissage automatique. Principes essentiels de mathématiques. Apprentissage supervisé. Apprentissage non supervisé. Apprentissage par renforcement. Algorithmes pour la régression, la classification, l'estimation de la densité et le regroupement.",
        "snippet": "Concepts de base de l'apprentissage automatique.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-73",
        "title": "CSI 4550 Introduction aux méthodes d'optimisation ",
        "description": "Modèles d'optimisation linéaire et leurs solutions. Techniques de modélisation des problèmes de programmation linéaire, les solutions par la méthode du simplex, théorie de la dualité, analyse de sensibilité, méthodes de point intérieur. Formulation de problèmes par programmation linéaire en nombres entiers, méthodes de résolution telles que les algorithmes de coupes et les algorithmes de séparation et évaluation.",
        "snippet": "Modèles d'optimisation linéaire et leurs solutions.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-74",
        "title": "CSI 4900 Projet de recherche / Honours Project ",
        "description": "Un projet d'une durée d'un semestre, à faire seul ou en petit groupe, sous la supervision d'un professeur. Les projets sont affichés et sont choisis durant le semestre précédent. Les étudiants doivent participer aux présentations des projets, cédulées à la fin du semestre. / A one-semester project, individual or for a small group, carried out under the supervision of a faculty member.  Projects are posted and selected in the preceding semester.  The students are required to participate in project presentations scheduled at the end of the semester.",
        "snippet": "Un projet d'une durée d'un semestre, à faire seul ou en petit groupe, sous la supervision d'un professeur.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-75",
        "title": "CSI 5100 Data Integration ",
        "description": "Materialized and virtual approaches to integration of heterogeneous and independent data sources. Emphasis on data models, architectures, logic-based techniques for query processing, metadata and consistency management, the role of XML and ontologies in data integration; connections to schema mapping, data exchange, and P2P systems. This course is equivalent to COMP 5306 at Carleton University.",
        "snippet": "Materialized and virtual approaches to integration of heterogeneous and independent data sources.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-76",
        "title": "CSI 5101 Knowledge Representation ",
        "description": "KR is concerned with representing knowledge and using it in computers. Emphasis on logic-based languages for KR, and automated reasoning techniques and systems; important applications of this traditional area of AI to ontologies and semantic web. This course is equivalent to COMP 5307 at Carleton University.",
        "snippet": "KR is concerned with representing knowledge and using it in computers.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-77",
        "title": "CSI 5102 Topics in Medical Computing ",
        "description": "Introductory course on data structures, algorithms, techniques, and software development related to medical computing (in particular spatial modeling). Topics may include: computational geometry algorithms for cancer treatment, medical imaging, spatial data compression algorithms, dynamic programming for DNA analysis. This course is equivalent to COMP 5308 at Carleton University.",
        "snippet": "Introductory course on data structures, algorithms, techniques, and software development related to medical computing (in particular spatial modeling).",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-78",
        "title": "CSI 5105 Network Security and Cryptography ",
        "description": "Advanced methodologies selected from symmetric and public key cryptography, network security protocols and infrastructure, identification, anonymity, privacy technologies, secret-sharing, intrusion detection, firewalls, access control technologies, and defending network attacks. This course is equivalent to COMP 5406 at Carleton University.",
        "snippet": "Advanced methodologies selected from symmetric and public key cryptography, network security protocols and infrastructure, identification, anonymity, privacy technologies, secret-sharing, intrusion detection, firewalls, access control technologies, and defending network attacks.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-79",
        "title": "CSI 5106 Cryptography ",
        "description": "Security in encryption algorithms. Encryption and decryption. Entropy, equivocation, and unicity distance.  Cryptanalysis and computational complexity. Substitution, transposition, and product ciphers. Symmetric ciphers: block and stream modes. Modular arithmetic. Public key cryptosystems. Factorization methods. Elliptic curve, lattice-based, and homomorphic cryptography. Proofs of security.",
        "snippet": "Security in encryption algorithms.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-80",
        "title": "CSI 5110 Principles of Formal Software Development ",
        "description": "Methodologies in formal software specification, development, and verification. The use of theorem proving, automated deduction, and other related formal methods for software correctness. Applications in program verification and secure computation.  This course is equivalent to COMP 5707 at Carleton University.",
        "snippet": "Methodologies in formal software specification, development, and verification.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-81",
        "title": "CSI 5111 Software Quality Engineering ",
        "description": "Software quality issues. Quality components and metrics. Software process quality. Software reliability  engineering. Software design for testability. Requirements capture and validation. Systematic design  validation; grey-box approach, test design, implementation and management, case studies in validation and verification of communications software. Object-oriented design and  test. Theoretical aspects. This course is equivalent to COMP 5501 at Carleton University.",
        "snippet": "Software quality issues.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-82",
        "title": "CSI 5112 Software Engineering ",
        "description": "Topics of current interest in Software Engineering, such as requirements engineering, precise and advanced modelling, development processes, change management, standards, and emerging types of applications. This course is equivalent to COMP 5207 at Carleton University.",
        "snippet": "Topics of current interest in Software Engineering, such as requirements engineering, precise and advanced modelling, development processes, change management, standards, and emerging types of applications.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-83",
        "title": "CSI 5113 Foundations Programming Languages ",
        "description": "Advanced study of programming paradigms from a practical perspective. Paradigms may include functional, imperative, concurrent, distributed, generative, aspect- and object-oriented, and logic programming. Emphasis on underlying principles. Topics may include: types, modules, inheritance, semantics, continuations, abstraction and reflection. This course is equivalent to COMP 5001 at Carleton University.",
        "snippet": "Advanced study of programming paradigms from a practical perspective.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-84",
        "title": "CSI 5115 Database Analysis and Design ",
        "description": "The dimensional and multidimensional data models for data warehousing. Data dependencies and decomposition. Structure and use of data definition and manipulation languages. Database economics, engineering, deployment and evolution. Issues in integrity, security, the Internet and distributed databases. Relationships to decision support systems. This course is equivalent to COMP 5503 at Carleton University.",
        "snippet": "The dimensional and multidimensional data models for data warehousing.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-85",
        "title": "CSI 5116 Authentication and Software Security ",
        "description": "Specialized topics in security including advanced authentication techniques, user interface aspects, electronic and digital signatures, security infrastructures and protocols, software vulnerabilities affecting security, non-secure software and hosts, protecting software and digital content. This course is equivalent to COMP 5407 at Carleton University.",
        "snippet": "Specialized topics in security including advanced authentication techniques, user interface aspects, electronic and digital signatures, security infrastructures and protocols, software vulnerabilities affecting security, non-secure software and hosts, protecting software and digital content.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-86",
        "title": "CSI 5118 Automated Verification and Validation of Software ",
        "description": "Topics in formal test derivation methods, test management, high-level, CASE-based verification and validation, data-flow & control-flow measures and metrics for assessing quality of designs and code, regression analysis & testing. This course is equivalent to COMP 5302 at Carleton University.",
        "snippet": "Topics in formal test derivation methods, test management, high-level, CASE-based verification and validation, data-flow & control-flow measures and metrics for assessing quality of designs and code, regression analysis & testing.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-87",
        "title": "CSI 5121 Advanced Data Structures ",
        "description": "Simple methods of data structure design and analysis that lead to efficient data structures for several problems. Topics include randomized binary search trees, persistence, fractional cascading, self-adjusting data structures, van Emde Boas trees, tries, randomized heaps, and lowest common ancestor queries. This course is equivalent to COMP 5408 at Carleton University.",
        "snippet": "Simple methods of data structure design and analysis that lead to efficient data structures for several problems.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-88",
        "title": "CSI 5122 Software Usability ",
        "description": "Design principles and metrics for usability. Qualitative and quantitative methods for the evaluation of software system usability: Heuristic evaluation, usability testing, usability inspections and walkthroughs, cognitive walkthroughs, formal usability experimentation. Ethical concerns when performing studies with test users. Economics of usability. Integration of usability engineering into the software engineering lifecycle. This course is equivalent to COMP 5301 at Carleton University.",
        "snippet": "Design principles and metrics for usability.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-89",
        "title": "CSI 5124 Computational Aspects of Geographic Information Systems ",
        "description": "Computational perspective of geographic information systems (GIS). Data representations and their operations on raster and vector devices: e.g., quadtrees, grid files, digital elevation models, triangular irregular network models. Analysis and design of efficient algorithms for solving GIS problems: visibility queries, point location, facility location. This course is equivalent to COMP 5204 at Carleton University.",
        "snippet": "Computational perspective of geographic information systems (GIS).",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-90",
        "title": "CSI 5126 Algorithms in Bioinformatics ",
        "description": "Fundamental mathematical and algorithmic concepts underlying computational molecular biology; physical and genetic mapping, sequence analysis (including alignment and probabilistic models), genomic rearrangement, phylogenetic inference, computational proteomics and systemics modelling of the whole cell. This course is equivalent to COMP 5108 at Carleton University.",
        "snippet": "Fundamental mathematical and algorithmic concepts underlying computational molecular biology; physical and genetic mapping, sequence analysis (including alignment and probabilistic models), genomic rearrangement, phylogenetic inference, computational proteomics and systemics modelling of the whole cell.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-91",
        "title": "CSI 5127 Applied Computational Geometry ",
        "description": "Design and analysis of efficient algorithms for solving geometric problems in applied fields such as Geometric Network Design, Geometric Routing and Searching. Geometric spanners, Greedy spanners, Theta-Graphs, Yao-Graphs, Well-Separated Pair Decomposition, Delaunay Triangulations. Introduction to the game of Cops and Robbers. This course is equivalent to COMP 5409 at Carleton University.",
        "snippet": "Design and analysis of efficient algorithms for solving geometric problems in applied fields such as Geometric Network Design, Geometric Routing and Searching.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-92",
        "title": "CSI 5128 Swarm Intelligence ",
        "description": "Collective computation, collective action, and principles of self-organization in social agent systems. Algorithms for combinatorial optimization problems, division of labour, task allocation, task switching, and task sequencing with applications in security, routing, wireless and ad hoc networks and distributed manufacturing. This course is equivalent to COMP 5002 at Carleton University.",
        "snippet": "Collective computation, collective action, and principles of self-organization in social agent systems.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-93",
        "title": "CSI 5129 Advanced Database Systems ",
        "description": "In-depth study on developments in database systems shaping the future of information systems, including complex object, object-oriented, object-relational, and semi-structured databases. Data structures, query languages, implementation and applications. This course is equivalent to COMP 5305 at Carleton University.",
        "snippet": "In-depth study on developments in database systems shaping the future of information systems, including complex object, object-oriented, object-relational, and semi-structured databases.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-94",
        "title": "CSI 5131 Parallel Algorithms and Applications in Bioinformatics ",
        "description": "Multiprocessor architectures from an application programmer's perspective: programming models, processor clusters, multi-core processors, GPUs, algorithmic paradigms, efficient parallel problem solving, scalability and portability. Projects on high performance computing in Data Science, including data analytics, bioinformatics, simulations. Programming experience on parallel processing equipment. This course is equivalent to COMP 5704 at Carleton University.",
        "snippet": "Multiprocessor architectures from an application programmer's perspective: programming models, processor clusters, multi-core processors, GPUs, algorithmic paradigms, efficient parallel problem solving, scalability and portability.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-95",
        "title": "CSI 5134 Fault Tolerance ",
        "description": "Hardware and software techniques for fault tolerance. Topics include modeling and evaluation techniques, error detecting and correcting codes, module and system level fault detection mechanisms, design techniques for fault-tolerant and fail-safe systems, software fault tolerance through recovery blocks, N-version programming, algorithm-based fault tolerance, checkpointing and recovery techniques, and survey of practical fault-tolerant systems. This course is equivalent to COMP 5004 at Carleton University.",
        "snippet": "Hardware and software techniques for fault tolerance.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-96",
        "title": "CSI 5135 Information Visualization and Visual Analytics ",
        "description": "Principles, techniques, technology and applications of information visualization for visual data analysis. Topics include human visual perception, cognitive processes, static and dynamic models of image semantics, interaction paradigms, big data visual analysis case studies. This course is equivalent to COMP 5209 at Carleton University.",
        "snippet": "Principles, techniques, technology and applications of information visualization for visual data analysis.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-97",
        "title": "CSI 5136 Computer Security and Usability ",
        "description": "Design and evaluation of security and privacy software with particular attention to human factors and how interaction design impacts security. Topics include current approaches to usable security, methodologies for empirical analysis, and design principles for usable security and privacy. This course is equivalent to COMP 5110 at Carleton University.",
        "snippet": "Design and evaluation of security and privacy software with particular attention to human factors and how interaction design impacts security.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-98",
        "title": "CSI 5137 Selected Topics in Software Engineering  ",
        "description": "Selected topics in Software Engineering (Category E), not covered by other graduate courses. Details will be available from the School at the time of registration. This course is equivalent to COMP 5900 at Carleton University.",
        "snippet": "Selected topics in Software Engineering (Category E), not covered by other graduate courses.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-99",
        "title": "CSI 5138 Selected Topics in Theory of Computing  ",
        "description": "Selected topics in Theory of Computing (Category T), not covered by other graduate courses. Details will be available from the School at the time of registration. This course is equivalent to COMP 5900 at Carleton University.",
        "snippet": "Selected topics in Theory of Computing (Category T), not covered by other graduate courses.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-100",
        "title": "CSI 5139 Selected Topics in Computer Applications  ",
        "description": "Selected topics in Computer Applications (Category A), not covered by other graduate courses. Details will be available from the School at the time of registration. This course is equivalent to COMP 5900 at Carleton University.",
        "snippet": "Selected topics in Computer Applications (Category A), not covered by other graduate courses.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-101",
        "title": "CSI 5140 Selected Topics in Computer Systems  ",
        "description": "Selected topics in Computer Systems (Category S), not covered by other graduate courses. Details will be available from the School at the time of registration. This course is equivalent to COMP 5900 at Carleton University.",
        "snippet": "Selected topics in Computer Systems (Category S), not covered by other graduate courses.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-102",
        "title": "CSI 5142 Protocols for Mobile and Wireless Networks ",
        "description": "Link and network layer protocols of wireless networks; applications of wireless networks may be discussed. Topics may include: protocol implementation, mobile IP, resource discovery, wireless LANs/PANs, and Spreadspectrum. Courses CSI 6136 (SYSC 5306), CSI 5142 (COMP 5402) cannot be combined for units. This course is equivalent to COMP 5402 at Carleton University.",
        "snippet": "Link and network layer protocols of wireless networks; applications of wireless networks may be discussed.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-103",
        "title": "CSI 5146 Computer Graphics ",
        "description": "Principles and advanced techniques in rendering and modelling. Research field overview. Splines, subdivision surfaces and hierarchical surface representations. Physics of light transport, rendering equation and Bidirectional Reflectance Distribution Function. Classical ray tracing, radiosity, global illumination and modern hybrid methods. Plenoptic function and image-based rendering. This course is equivalent to COMP 5402 at Carleton University.",
        "snippet": "Principles and advanced techniques in rendering and modelling.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-104",
        "title": "CSI 5147 Computer Animation ",
        "description": "Theories and techniques in 3D modeling and animation. Animation principles, categories, and history. Forward and inverse kinematics. Motion capture, editing and retargeting. Flexible bodies. Particle animation. Behavioral animation. Human modeling. Facial animation. Cloth animation and other sub-topics. This course is equivalent to COMP 5201 at Carleton University.",
        "snippet": "Theories and techniques in 3D modeling and animation.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-105",
        "title": "CSI 5148 Wireless Ad Hoc Networking ",
        "description": "Self-organized, mobile, and hybrid ad hoc networks. Physical, medium access, networks, transport and application layers, and cross-layering issues. Power management. Security in ad hoc networks. Topology control and maintenance. Data communication protocols, routing and broadcasting. Location service for efficient routing. This course is equivalent to COMP 5103 at Carleton University.",
        "snippet": "Self-organized, mobile, and hybrid ad hoc networks.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-106",
        "title": "CSI 5149 Graphical Models and Applications ",
        "description": "Bayesian networks, factor graphs, Markov random fields, maximum a posteriori probability (MAP) and maximum likelihood (ML) principles, elimination algorithm, sum-product algorithm, decomposable and non-decomposable models, junction tree algorithm, completely observed models, iterative proportional fitting algorithm, expectation- maximization (EM) algorithm, iterative conditional modes algorithm, variational methods, applications. Courses CSI 5149 (COMP 5007), ELG 5131 (EAGJ 5131) and ELG 7177 (EACJ 5605) cannot be combined for units. This course is equivalent to COMP 5007 at Carleton University.",
        "snippet": "Bayesian networks, factor graphs, Markov random fields, maximum a posteriori probability (MAP) and maximum likelihood (ML) principles, elimination algorithm, sum-product algorithm, decomposable and non-decomposable models, junction tree algorithm, completely observed models, iterative proportional fitting algorithm, expectation- maximization (EM) algorithm, iterative conditional modes algorithm, variational methods, applications.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-107",
        "title": "CSI 5151 Virtual Environments ",
        "description": "Basic concepts. Virtual worlds. Hardware and software support. World modeling. Geometric modeling. Light modeling. Kinematic and dynamic models. Other physical modeling modalities. Multi-sensor data fusion. Anthropomorphic avatars. Animation: modeling languages, scripts, real-time computer architectures. Virtual environment interfaces. Case studies. Courses ELG 5124 (EACJ 5204), CSI 5151 (COMP 5205) cannot be combined for units. This course is equivalent to COMP 5205 at Carleton University.",
        "snippet": "Basic concepts.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-108",
        "title": "CSI 5152 Evolving Information Networks ",
        "description": "Convergence of social and technological networks with WWW. Interplay between information content, entities creating it and technologies supporting it. Structure and analysis of such networks, models abstracting their properties, link analysis, search, mechanism design, power laws, cascading, clustering and connections with work in social sciences. This course is equivalent to COMP 5310 at Carleton University.",
        "snippet": "Convergence of social and technological networks with WWW.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-109",
        "title": "CSI 5153 Data Management for Business Intelligence ",
        "description": "Data management problems and information technology in decision making support in business environments. Topics include advanced data modeling, semantic modeling, multidimensional databases and data warehousing, on-line-analytical processing, elements of data mining, context in data management, data quality assessment, data cleaning, elements of business process modeling. This course emphasizes concepts and techniques rather than specific applications or systems/implementations. This course is equivalent to COMP 5111 at Carleton University.",
        "snippet": "Data management problems and information technology in decision making support in business environments.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-110",
        "title": "CSI 5154 Algorithms for Data Science ",
        "description": "Algorithmic techniques to handle (massive/big) data arising from, for example, social media, mobile devices, sensors, financial transactions. Algorithmic techniques may include locality-sensitive hashing, dimensionality reduction, streaming, clustering, VC-dimension, external memory, core sets, link analysis and recommendation systems. This course is equivalent to COMP 5112 at Carleton University.",
        "snippet": "Algorithmic techniques to handle (massive/big) data arising from, for example, social media, mobile devices, sensors, financial transactions.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-111",
        "title": "CSI 5155 Machine Learning ",
        "description": "Concepts, techniques, and algorithms in machine learning; representation, regularization and generalization; supervised learning; unsupervised learning; advanced methods such as support vector machines, online algorithms, neural networks, hidden Markov models, and Bayesian networks; curse of dimensionality and large-scale machine learning. Category T in course list.",
        "snippet": "Concepts, techniques, and algorithms in machine learning; representation, regularization and generalization; supervised learning; unsupervised learning; advanced methods such as support vector machines, online algorithms, neural networks, hidden Markov models, and Bayesian networks; curse of dimensionality and large-scale machine learning.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-112",
        "title": "CSI 5161 Principles of Distributed Simulation ",
        "description": "Distributed simulation principles and practices. Synchronization protocols: Optimistic vs Conservative,  Deadlock detection in conservative simulations, Time warp simulation. Distributed interactive simulation:  Data distribution management, Interest management, High Level Architectures (HLA), Run Time Infrastructure (RTI). Distributed web-based simulation. Distributed agent based simulation. Real time applications of distributed simulation. Distributed and collaborative virtual simulations. This course is equivalent to COMP 5606 at Carleton University.",
        "snippet": "Distributed simulation principles and practices.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-113",
        "title": "CSI 5163 Algorithm Analysis and Design ",
        "description": "Topics of current interest in the design and analysis of computer algorithms for graph-theoretical applications; e.g. shortest paths, chromatic number, etc. Lower bounds, upper bounds, and average performance of algorithms. Complexity theory. This course is equivalent to COMP 5703 at Carleton University.",
        "snippet": "Topics of current interest in the design and analysis of computer algorithms for graph-theoretical applications; e.g.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-114",
        "title": "CSI 5164 Computational Geometry ",
        "description": "Study of design and analysis of algorithms to solve geometric problems; emphasis on applications such as robotics, graphics, and pattern recognition. Topics include: visibility problems, hidden line and surface removal, path planning amidst obstacles, convex hulls, polygon triangulation, point location. This course is equivalent to COMP 5008 at Carleton University.",
        "snippet": "Study of design and analysis of algorithms to solve geometric problems; emphasis on applications such as robotics, graphics, and pattern recognition.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-115",
        "title": "CSI 5165 Combinatorial Algorithms ",
        "description": "Design of algorithms for solving problems that are combinatorial in nature, involving exhaustive generation, enumeration, search and optimization. Algorithms for generating basic combinatorial objects (permutations, combinations, subsets) and for solving hard optimization problems (knapsack, maximum clique, minimum set cover). Metaheuristic search, backtracking, branch-and-bound. Computing isomorphism of combinatorial objects (graphs), isomorph-free exhaustive generation. This course is equivalent to COMP 5709 at Carleton University.",
        "snippet": "Design of algorithms for solving problems that are combinatorial in nature, involving exhaustive generation, enumeration, search and optimization.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-116",
        "title": "CSI 5166 Applications of Combinatorial Optimization ",
        "description": "Topics in combinatorial optimization with emphasis on applications in Computer Science. Topics include network flows, various routing algorithms, polyhedral combinatorics, and the cutting plane method. This course is equivalent to COMP 5805 at Carleton University.",
        "snippet": "Topics in combinatorial optimization with emphasis on applications in Computer Science.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-117",
        "title": "CSI 5167 Human-Computer Interaction Models, Theories and Frameworks ",
        "description": "A basis for graduate study in HCI with an emphasis on the application of theory to user interface design. Review of main theories of human behaviour relevant to HCI, including especially Cognitive Dimensions of Notations Framework, Mental Models, Distributed Cognition, and Activity Theory, and their application to design and development of interactive systems. This course is equivalent to COMP 5210 at Carleton University.",
        "snippet": "A basis for graduate study in HCI with an emphasis on the application of theory to user interface design.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-118",
        "title": "CSI 5168 Digital Watermarking ",
        "description": "Overview of recent advances in watermarking of image, video, audio, and other media. Spatial, spectral, and temporal watermarking algorithms. Perceptual models. Use of cryptography in steganography and watermarking. Robustness, security, imperceptibility, and capacity of watermarking. Content authentication, copy control, intellectual property, digital rights management, and other applications. This course is equivalent to COMP 5309 at Carleton University.",
        "snippet": "Overview of recent advances in watermarking of image, video, audio, and other media.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-119",
        "title": "CSI 5169 Wireless Networks and Mobile Computing ",
        "description": "Computational aspects and applications of design and analysis of mobile and wireless networking. Topics include Physical, Link Layer, Media Access Control, Wireless, Mobile LANs (Local Area Networks), Ad-Hoc, Sensor Networks, Power Consumption optimization, Routing, Searching, Service Discovery, Clustering, Multicasting, Localization, Mobile IP/TCP (Internet Protocol/Transmission Control Protocol), File Systems, Mobility Models, Wireless Applications. Courses CSI 5169, ELG 6168 cannot be combined for units. This course is equivalent to COMP 5304 at Carleton University.",
        "snippet": "Computational aspects and applications of design and analysis of mobile and wireless networking.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-120",
        "title": "CSI 5173 Data Networks ",
        "description": "Mathematical and practical aspects of design and analysis of communication networks. Topics include: basic concepts, layering, delay models, multi-access communication, queuing theory, routing, fault-tolerance, and advanced topics on high-speed networks, ATM, mobile wireless networks, and optical networks. This course is equivalent to COMP 5203 at Carleton University.",
        "snippet": "Mathematical and practical aspects of design and analysis of communication networks.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-121",
        "title": "CSI 5174 Validation Methods for Distributed Systems ",
        "description": "Review of formal specification and description techniques for distributed and open systems. Verification techniques. Correctness proofs. Verification of general properties of distributed systems. Analysis and relief strategies. Testing techniques. Test generation strategies. Test architectures. This course is equivalent to COMP 5604 at Carleton University.",
        "snippet": "Review of formal specification and description techniques for distributed and open systems.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-122",
        "title": "CSI 5175 Mobile Commerce Technologies ",
        "description": "Wireless networks support for m-commerce; m-commerce architectures and applications; mobile payment support systems; business models; mobile devices and their operating systems; mobile content presentation; security issues and solutions; relevant cross layer standards and protocols; case studies. Courses EBC 5175, CSI 5175 cannot be combined for units. This course is equivalent to COMP 5900 at Carleton University.",
        "snippet": "Wireless networks support for m-commerce; m-commerce architectures and applications; mobile payment support systems; business models; mobile devices and their operating systems; mobile content presentation; security issues and solutions; relevant cross layer standards and protocols; case studies.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-123",
        "title": "CSI 5180 Topics in Artificial Intelligence ",
        "description": "Selected topics in Artificial Intelligence (A.I.); could include A.I. programming techniques, pattern matching systems, natural language systems, rule-based systems, constraint systems, machine learning systems, and cognitive systems. Applications could include areas in Finance, Medicine, Manufacturing, Smart Cities, Semantic Web, Healthcare, Fraud Detection, Intrusion Detection, Autonomous Vehicles, Opinion mining, Sentiment Analysis or similar areas. Assignments will be both (a) programming-oriented, requiring implementation and/or extensions of prototypes in Lisp and/or Prolog and (b) research-oriented, requiring readings of special topics in current A.I. journals. This course is equivalent to COMP 5100 at Carleton University.",
        "snippet": "Selected topics in Artificial Intelligence (A.I.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-124",
        "title": "CSI 5183 Evolutionary Computation and Artificial Life ",
        "description": "Study of algorithms based upon biological theories of evolution, applications to machine learning and optimization problems. Possible topics: Genetic Algorithms, Classifier Systems, and Genetic Programming. Recent work in the fields of Artificial Life (swarm intelligence, distributed agents, behavior-based AI) and of connectionism. This course is equivalent to COMP 5206 at Carleton University.",
        "snippet": "Study of algorithms based upon biological theories of evolution, applications to machine learning and optimization problems.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-125",
        "title": "CSI 5185 Statistical and Syntactic Pattern Recognition ",
        "description": "Topics include a mathematical review, Bayes decision theory, maximum likelihood and Bayesian learning for parametric pattern recognition, non-parametric methods including nearest neighbor and linear discriminants. Syntactic recognition of strings, substrings, subsequences and tree structures. Applications include speech, shape and character recognition. This course is equivalent to COMP 5107 at Carleton University.",
        "snippet": "Topics include a mathematical review, Bayes decision theory, maximum likelihood and Bayesian learning for parametric pattern recognition, non-parametric methods including nearest neighbor and linear discriminants.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-126",
        "title": "CSI 5200 Projects on Selected Topics ",
        "description": "",
        "snippet": "",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-127",
        "title": "CSI 5308 Principles of Distributed Computing ",
        "description": "Formal models of distributed environment; theoretical issues in the design of distributed algorithms; message and time complexity; problem solving in distributed settings. Problems discussed may include: coordination and control, information diffusion, leader election, consensus, distributed data operations, computing by mobile entities. This course is equivalent to COMP 5003 at Carleton University.",
        "snippet": "Formal models of distributed environment; theoretical issues in the design of distributed algorithms; message and time complexity; problem solving in distributed settings.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-128",
        "title": "CSI 5311 Distributed Databases and Transaction Processing ",
        "description": "Principles involved in the design and implementation of distributed databases and distributed transaction processing systems. Topics include: distributed and multi-database system architectures and models, atomicity, synchronization and distributed concurrency control algorithms, data replication, recovery techniques, and reliability in distributed databases. This course is equivalent to COMP 5101 at Carleton University.",
        "snippet": "Principles involved in the design and implementation of distributed databases and distributed transaction processing systems.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-129",
        "title": "CSI 5312 Distributed Operating Systems Engineering ",
        "description": "Design issues of advanced multiprocessor distributed operating systems: multiprocessor system architectures; process and object models; synchronization and message passing primitives; memory architectures and management; distributed file systems; protection and security; distributed concurrency control; deadlock; recovery; remote tasking; dynamic reconfiguration; performance measurement, modeling, and system tuning. This course is equivalent to COMP 5102 at Carleton University.",
        "snippet": "Design issues of advanced multiprocessor distributed operating systems: multiprocessor system architectures; process and object models; synchronization and message passing primitives; memory architectures and management; distributed file systems; protection and security; distributed concurrency control; deadlock; recovery; remote tasking; dynamic reconfiguration; performance measurement, modeling, and system tuning.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-130",
        "title": "CSI 5314 Object-Oriented Software Development ",
        "description": "Issues in modeling and verifying quality and variability in object-oriented systems. Testable models in model-driven and test-driven approaches. System family engineering. Functional conformance: scenario modeling and verification, design by contract. Conformance to non-functional requirements: goals, forces and tradeoffs, metrics. This course is equivalent to COMP 5104 at Carleton University.",
        "snippet": "Issues in modeling and verifying quality and variability in object-oriented systems.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-131",
        "title": "CSI 5380 Systems and Architectures for Electronic Commerce ",
        "description": "E-commerce system architecture with a focus on relevant design patterns. Web servers, containers, and application frameworks. Web protocols, services, and client technologies. Scalability through load balancing, clustering, and code optimization. Internationalization, accessibility, and privacy. Data mining and sharing approaches for digital targeted advertising. E-commerce user interface design and evaluation. Current research issues. Hands-on experience with an integrated set of current e-commerce tools. E-commerce development project. Courses EBC 5380, CSI 5380 cannot be combined for units. This course is equivalent to COMP 5405 at Carleton University.",
        "snippet": "E-commerce system architecture with a focus on relevant design patterns.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-132",
        "title": "CSI 5386 Natural Language Processing ",
        "description": "Overview of both rule-based or symbolic methods and statistical methods as approaches to Natural Language Processing (NLP), with more emphasis on the statistical ones. Applications such as information retrieval, text categorization, clustering, and statistical machine translation could be discussed. This course is equivalent to COMP 5505 at Carleton University.",
        "snippet": "Overview of both rule-based or symbolic methods and statistical methods as approaches to Natural Language Processing (NLP), with more emphasis on the statistical ones.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-133",
        "title": "CSI 5387 Data Mining and Concept Learning ",
        "description": "Concepts and techniques of data mining. Methods for data summarization and data preprocessing. Algorithms for finding frequent patterns and association analysis; classification; cluster analysis and anomaly detection. Model selection, model evaluation and statistical significance testing. Approaches for coping with Big Data. Selected applications of data mining and concept learning.",
        "snippet": "Concepts and techniques of data mining.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-134",
        "title": "CSI 5388 Topics in Machine Learning ",
        "description": "",
        "snippet": "",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-135",
        "title": "CSI 5389 Electronic Commerce Technologies ",
        "description": "Business models and technologies. Search engines. Cryptography. Web services and agents. Secure electronic transactions.  Value added e-commerce technologies. Advanced research questions. Courses EBC5389, CSI5389 cannot be combined for units. This course is equivalent to COMP 5401 at Carleton University.",
        "snippet": "Business models and technologies.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-136",
        "title": "CSI 5390 Learning Systems from Random Environments ",
        "description": "Computerized adaptive learning for random environments and its applications. Topics include a mathematical review, learning automata which are deterministic/stochastic, with fixed/variable structures, of continuous/discretized design, with ergodic/absorbing properties and of estimator families.",
        "snippet": "Computerized adaptive learning for random environments and its applications.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-137",
        "title": "CSI 5500 Projets en informatique ",
        "description": "",
        "snippet": "",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-138",
        "title": "CSI 5501 Modèles formels de l'information ",
        "description": "",
        "snippet": "",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-139",
        "title": "CSI 5510 Principles de développement formel de logiciels ",
        "description": "Méthodologies pour la spécification, le développement et la vérification formels de logiciels. Utilisation d'assistants de preuves, de déduction automatisée et d'autres méthodes formelles visant l'exactitude de logiciel. Applications à la vérification de programmes et au calcul sécurisé. Ce cours est équivalent à COMP 5707 à la Carleton University.",
        "snippet": "Méthodologies pour la spécification, le développement et la vérification formels de logiciels.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-140",
        "title": "CSI 5511 Génie de la qualité des logiciels ",
        "description": "Critères de la qualité des logiciels. Composantes et métriques de qualité. Qualité du processus de développement des logiciels. Génie de fiabilité des logiciels. Capture et validation d'exigences. Validation systématique de la conception; approche boîte-grise. Conception, implantation et gestion des tests. Étude de cas en validation et vérification des logiciels de communication. Conception orientée objet. Aspects théoriques. Ce cours est équivalent à COMP 5501 à la Carleton University.",
        "snippet": "Critères de la qualité des logiciels.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-141",
        "title": "CSI 5526 Algorithmes en bio-informatique ",
        "description": "Assemblage de l'ADN, recherche de gênes, comparaison de chaînes, alignement de séquences, structures grammaticales, structures secondaires et tertiaires. Les récents développements, tels que les puces d'ADN et de protéines. Travail additionnel requis dans le cas des étudiants inscrits sous la cote CSI 5526.",
        "snippet": "Assemblage de l'ADN, recherche de gênes, comparaison de chaînes, alignement de séquences, structures grammaticales, structures secondaires et tertiaires.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-142",
        "title": "CSI 5537 Thème choisi en génie logiciel  ",
        "description": "Thèmes choisis en génie logiciel (catégorie E), non couverts par d'autres cours de deuxième cycle. Les détails seront disponibles à l'école au moment de l'inscription. Ce cours est équivalent à COMP 5900 à la Carleton University.",
        "snippet": "Thèmes choisis en génie logiciel (catégorie E), non couverts par d'autres cours de deuxième cycle.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-143",
        "title": "CSI 5538 Thème choisi en théorie de l'informatique  ",
        "description": "Thèmes choisis en théorie de l'informatique (catégorie T), non couverts par d'autres cours de deuxième cycle. Les détails seront disponibles à l'école au moment de l'inscription. Ce cours est équivalent à COMP 5900 à la Carleton University.",
        "snippet": "Thèmes choisis en théorie de l'informatique (catégorie T), non couverts par d'autres cours de deuxième cycle.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-144",
        "title": "CSI 5539 Thème choisi en application informatique  ",
        "description": "Thèmes choisis en application informatique (catégorie A), non couverts par d'autres cours de deuxième cycle. Les détails seront disponibles à l'école au moment de l'inscription. Ce cours est équivalent à COMP 5900 à la Carleton University.",
        "snippet": "Thèmes choisis en application informatique (catégorie A), non couverts par d'autres cours de deuxième cycle.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-145",
        "title": "CSI 5540 Thème choisi en systèmes informatiques  ",
        "description": "Thèmes choisis en systèmes informatiques (catégorie S), non couverts par d'autres cours de deuxième cycle. Les détails seront disponibles à l'école au moment de l'inscription. Ce cours est équivalent à COMP 5900 à la Carleton University.",
        "snippet": "Thèmes choisis en systèmes informatiques (catégorie S), non couverts par d'autres cours de deuxième cycle.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-146",
        "title": "CSI 5555 Apprentissage machine ",
        "description": "Concepts, techniques et algorithmes en apprentissage machine; représentation, régularisation et généralisation; apprentissage supervisé; apprentissage non supervisé; méthodes avancées telles que les machines à vecteur de support, les algorithmes en ligne, les réseaux de neurones; les modèles de Markov cachés et les réseaux bayésiens; le fléau de la dimensionnalité et l'apprentissage machine à grande échelle. Catégorie T dans la liste de cours.",
        "snippet": "Concepts, techniques et algorithmes en apprentissage machine; représentation, régularisation et généralisation; apprentissage supervisé; apprentissage non supervisé; méthodes avancées telles que les machines à vecteur de support, les algorithmes en ligne, les réseaux de neurones; les modèles de Markov cachés et les réseaux bayésiens; le fléau de la dimensionnalité et l'apprentissage machine à grande échelle.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-147",
        "title": "CSI 5561 Sujets en simulation et en optimisation des systèmes ",
        "description": "",
        "snippet": "",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-148",
        "title": "CSI 5563 Analyse et conception des algorithmes ",
        "description": "",
        "snippet": "",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-149",
        "title": "CSI 5565 Algorithmes combinatoires ",
        "description": "Conception d'algorithmes pour résoudre des problèmes de nature combinatoire (génération exhaustive, énumération, recherche et optimisation). Algorithmes pour générer des objets combinatoires de base (permutations, combinaisons, sous-ensembles) et pour résoudre des problèmes d'optimisation difficiles (knapsack, clique maximum, couverture minimum). Recherche métaheuristique, retour arrière, branch-and-bound. Calcul de l'isomorphisme des objets combinatoires (graphes), génération exhaustive sans isomorphes. Ce cours est équivalent à COMP 5709 à l'Université Carleton.",
        "snippet": "Conception d'algorithmes pour résoudre des problèmes de nature combinatoire (génération exhaustive, énumération, recherche et optimisation).",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-150",
        "title": "CSI 5571 Télématique : Concepts et logiciels ",
        "description": "",
        "snippet": "",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-151",
        "title": "CSI 5580 Sujets en intelligence artificielle ",
        "description": "Thèmes choisis en intelligence artificielle (I.A.); pourrait inclure des techniques de programmation en intelligence artificielle, des systèmes d'appariement de formes, des systèmes à langage naturel, des systèmes à base de règles, des systèmes de contraintes, des systèmes d'apprentissage automatique et des systèmes cognitifs. Les applications peuvent couvrir les domaines de la finance, de la médecine, de la fabrication, des villes intelligentes, du Web sémantique, de la détection de fraudes ou d’intrusion, des véhicules autonomes, de l'analyse d’opinion, de l'analyse de sentiments ou d’autres domaines similaires.  Les devoirs seront à la fois (a) axés sur la programmation, exigeant l'implémentation et/ou l'extension de prototypes (b) axés sur la recherche, nécessitant des lectures de sujets spéciaux dans des revus d'I.A. contemporaines. Ce cours est équivalent à COMP 5100 à l'Université Carleton.",
        "snippet": "Thèmes choisis en intelligence artificielle (I.A.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-152",
        "title": "CSI 5780 Systèmes et architectures des logiciels pour le commerce électronique ",
        "description": "Architecture du système de commerce électronique et patrons de conception. Serveurs Web, conteneurs et cadres d'application. Protocoles, services, et technologies de client Web. Évolutivité grâce à l'équilibrage de la charge, au clustering et à l'optimisation du code. Internationalisation, accessibilité et confidentialité. Méthodes d'exploration et de partage de données pour la publicité ciblée numérique. Conception et évaluation de l'interface utilisateur pour le commerce électronique. Problèmes de recherche actuels. Expérience pratique avec un ensemble intégré d'outils de commerce électronique actuels. Projet de développement du commerce électronique. Les cours EBC 5380, CSI 5380 ne peuvent pas être combinés pour les unités. Ce cours est équivalent à COMP 5405 à la Carleton University.",
        "snippet": "Architecture du système de commerce électronique et patrons de conception.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-153",
        "title": "CSI 5787 Fouille des données et apprentissage des concepts ",
        "description": "Aspects conceptuels et techniques de l’exploration des données. Méthodes pour l'agrégation et le prétraitement des données.  Algorithmes d'extraction de patrons et analyse des règles d'association; partitionnement des données et détection des anomalies.  Sélection et évaluation des modèles et tests de signification statistique.  Approches pour composer avec les mégadonnées.  Choix d'applications en exploration des données et en extraction des concepts.",
        "snippet": "Aspects conceptuels et techniques de l’exploration des données.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-154",
        "title": "CSI 5789 Technologies du commerce électronique ",
        "description": "Introduction aux modèles et technologies d'entreprise. Moteurs de recherche. Cryptographie. Services Web et agents. Transactions électroniques sécurisées. Technologies du commerce électronique à valeur ajoutée. Questions de recherche avancées. Ce cours est équivalent à COMP 5401 à la Carleton University.",
        "snippet": "Introduction aux modèles et technologies d'entreprise.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-155",
        "title": "CSI 5900 Projets de recherche en informatique / Graduate Projects in Computer Science ",
        "description": "Ce cours est équivalent à COMP 5902 à la Carleton University. / This course is equivalent to COMP 5902 at Carleton University.",
        "snippet": "Ce cours est équivalent à COMP 5902 à la Carleton University.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-156",
        "title": "CSI 5901 Études dirigées / Directed Studies ",
        "description": "A course of independent study under the supervision of a member of the School of Computer Science. Ce cours est équivalent à COMP 5901 à la Carleton University. / This course is equivalent to COMP 5901 at Carleton University.",
        "snippet": "A course of independent study under the supervision of a member of the School of Computer Science.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-157",
        "title": "CSI 5903 Stage en commerce électronique / Electronic Commerce Work Term ",
        "description": "Expérience en milieu de travail. Noté S (satisfaisant) ou NS (non satisfaisant) selon les résultats du rapport écrit et l'évaluation de l'employeur. Préalable : être accepté au programme de certificat en commerce électronique (option technologie) et recevoir la permission du Comité du programme. / Practical experience. Graded S (Satisfactory) / NS (Not satisfactory), to be based on the grades obtained for the written report as well as on the evaluations of the employer.",
        "snippet": "Expérience en milieu de travail.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-158",
        "title": "CSI 5904 Projet de recherche avancé en commerce électronique / Graduate Project in Electronic Commerce ",
        "description": "Projet sur un sujet précis en commerce électronique mené sous la direction d'un professeur. Les cours CSI 5904, CSI 5903 ne peuvent être combinés pour l'obtention de crédits. / Project on a specific topic in electronic commerce under the supervision of a professor. Courses CSI 5904, CSI 5903 cannot be combined for units.",
        "snippet": "Projet sur un sujet précis en commerce électronique mené sous la direction d'un professeur.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-159",
        "title": "CSI 6900 Projets de recherche intensive en informatique / Intensive Graduate Projects in Computer Science ",
        "description": "Cours de six crédits s'échelonnant sur une période de deux sessions. L'envergure du projet de recherche exigé dans ce cours est deux fois plus grande que dans le cas de CSI 5900. Les cours CSI 6900, CSI 5900 ne peuvent être combinés pour l'obtention de crédits. Cours ouvert uniquement aux étudiants inscrits à la maîtrise sans thèse. Ce cours est équivalent à COMP 5903 à la Carleton University. / A two-session course. The project is twice the scope of projects in CSI 5900. Courses CSI 6900, CSI 5900 cannot be combined for units. Not to be taken in the thesis option. This course is equivalent to COMP 5903 at Carleton University.",
        "snippet": "Cours de six crédits s'échelonnant sur une période de deux sessions.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-160",
        "title": "CSI 7131 Advanced Parallel and Systolic Algorithms ",
        "description": "Continuation of CSI 5131 (COMP 5704). This course is equivalent to COMP 6100 at Carleton University.",
        "snippet": "Continuation of CSI 5131 (COMP 5704).",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-161",
        "title": "CSI 7160 Advanced Topics in the Theory of Computing ",
        "description": "This course is equivalent to COMP 6601 at Carleton University.",
        "snippet": "This course is equivalent to COMP 6601 at Carleton University.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-162",
        "title": "CSI 7161 Advanced Topics in Programming Systems and Languages ",
        "description": "This course is equivalent to COMP 6603 at Carleton University.",
        "snippet": "This course is equivalent to COMP 6603 at Carleton University.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-163",
        "title": "CSI 7162 Advanced Topics in Computer Applications ",
        "description": "This course is equivalent to COMP 6604 at Carleton University.",
        "snippet": "This course is equivalent to COMP 6604 at Carleton University.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-164",
        "title": "CSI 7163 Advanced Topics in Computer Systems ",
        "description": "This course is equivalent to COMP 6605 at Carleton University.",
        "snippet": "This course is equivalent to COMP 6605 at Carleton University.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-165",
        "title": "CSI 7170 Advanced Topics in Distributed Computing ",
        "description": "This course is equivalent to COMP 6602 at Carleton University.",
        "snippet": "This course is equivalent to COMP 6602 at Carleton University.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-166",
        "title": "CSI 7314 Advanced Topics in Object-Oriented Systems ",
        "description": "Advanced object-oriented software engineering, in particular the issues of reuse and testing. Sample topics include: interaction modeling; class and cluster testing; traceability; design patterns and testing; the C++ standard template library. Students will carry out research. This course is equivalent to COMP 6104 at Carleton University.",
        "snippet": "Advanced object-oriented software engineering, in particular the issues of reuse and testing.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-167",
        "title": "CSI 7561 Études avancées en systèmes et langages de programmation ",
        "description": "Ce cours est équivalent à COMP 6603 à la Carleton University.",
        "snippet": "Ce cours est équivalent à COMP 6603 à la Carleton University.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-168",
        "title": "CSI 7900 Projets de recherche en informatique / Graduate Projects in Computer Science ",
        "description": "Ce cours est équivalent à COMP 6902 à la Carleton University. / This course is equivalent to COMP 6902 at Carleton University.",
        "snippet": "Ce cours est équivalent à COMP 6902 à la Carleton University.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-169",
        "title": "CSI 7901 Études dirigées / Directed Studies ",
        "description": "Ce cours est équivalent à COMP 6901 à la Carleton University. / This course is equivalent to COMP 6901 at Carleton University.",
        "snippet": "Ce cours est équivalent à COMP 6901 à la Carleton University.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-170",
        "title": "CSI 9901 Colloque / Seminar",
        "description": "",
        "snippet": "",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-171",
        "title": "CSI 9902 Colloque / Seminar",
        "description": "",
        "snippet": "",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-172",
        "title": "CSI 9997 Proposition de thèse de doctorat / Doctoral Thesis Proposal",
        "description": "Within 8 terms following initial registration in the program, a document, generally defining the problem addressed, relating it to the literature, outlining the hypotheses, goals, research methodology, initial results and validation approach, must be submitted to an examination committee and successfully defended. Ce cours est équivalent à COMP 6908 à la Carleton University. This course is equivalent to COMP 6908 at Carleton University.",
        "snippet": "Within 8 terms following initial registration in the program, a document, generally defining the problem addressed, relating it to the literature, outlining the hypotheses, goals, research methodology, initial results and validation approach, must be submitted to an examination committee and successfully defended.",
        "topic": "Uottawa Courses"
    },
    {
        "doc_id": "CSI-173",
        "title": "CSI 9998 Examen général de doctorat / Ph.D. Comprehensive",
        "description": "A committee must be assembled and must approve at least 3 topics for written examination: typically, a major and two minor areas. An oral examination occurs if the written exam is passed. Both elements must take place within the first 4 terms following initial registration in the program. The comprehensive examination may be failed, passed conditionally (i.e., with extra course requirements) or passed unconditionally. If failed, this course may be retaken at most one time. Ce cours est équivalent à COMP 6907 à la Carleton University. This course is equivalent to COMP 6907 at Carleton University.",
        "snippet": "A committee must be assembled and must approve at least 3 topics for written examination: typically, a major and two minor areas.",
        "topic": "Uottawa Courses"
    }
]